vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/periph1/PERI_DMA.h
/*
** ###################################################################
**     Processors:          MCXA144VFT
**                          MCXA144VLH
**                          MCXA144VLL
**                          MCXA144VMP
**                          MCXA144VPJ
**                          MCXA145VFT
**                          MCXA145VLH
**                          MCXA145VLL
**                          MCXA145VMP
**                          MCXA145VPJ
**                          MCXA146VFT
**                          MCXA146VLH
**                          MCXA146VLL
**                          MCXA146VMP
**                          MCXA146VPJ
**                          MCXA154VFT
**                          MCXA154VLH
**                          MCXA154VLL
**                          MCXA154VMP
**                          MCXA154VPJ
**                          MCXA155VFT
**                          MCXA155VLH
**                          MCXA155VLL
**                          MCXA155VMP
**                          MCXA155VPJ
**                          MCXA156VFT
**                          MCXA156VLH
**                          MCXA156VLL
**                          MCXA156VMP
**                          MCXA156VPJ
**
**     Version:             rev. 2.0, 2024-10-29
**     Build:               b250521
**
**     Abstract:
**         CMSIS Peripheral Access Layer for DMA
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2022-03-29)
**         Initial version based on v0.1UM
**     - rev. 2.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_DMA.h
 * @version 2.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for DMA
 *
 * CMSIS Peripheral Access Layer for DMA
 */

#if !defined(PERI_DMA_H_)
#define PERI_DMA_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXA144VFT) || defined(CPU_MCXA144VLH) || defined(CPU_MCXA144VLL) || defined(CPU_MCXA144VMP) || defined(CPU_MCXA144VPJ))
#include "MCXA144_COMMON.h"
#elif (defined(CPU_MCXA145VFT) || defined(CPU_MCXA145VLH) || defined(CPU_MCXA145VLL) || defined(CPU_MCXA145VMP) || defined(CPU_MCXA145VPJ))
#include "MCXA145_COMMON.h"
#elif (defined(CPU_MCXA146VFT) || defined(CPU_MCXA146VLH) || defined(CPU_MCXA146VLL) || defined(CPU_MCXA146VMP) || defined(CPU_MCXA146VPJ))
#include "MCXA146_COMMON.h"
#elif (defined(CPU_MCXA154VFT) || defined(CPU_MCXA154VLH) || defined(CPU_MCXA154VLL) || defined(CPU_MCXA154VMP) || defined(CPU_MCXA154VPJ))
#include "MCXA154_COMMON.h"
#elif (defined(CPU_MCXA155VFT) || defined(CPU_MCXA155VLH) || defined(CPU_MCXA155VLL) || defined(CPU_MCXA155VMP) || defined(CPU_MCXA155VPJ))
#include "MCXA155_COMMON.h"
#elif (defined(CPU_MCXA156VFT) || defined(CPU_MCXA156VLH) || defined(CPU_MCXA156VLL) || defined(CPU_MCXA156VMP) || defined(CPU_MCXA156VPJ))
#include "MCXA156_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
#if !defined(DMA_REQUEST_SOURCE_T_)
#define DMA_REQUEST_SOURCE_T_
/*!
 * @addtogroup dma_request
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections. The user can configure the
 * hardware request to trigger the DMA transfer accordingly. The index
 * of the hardware request varies according  to the to SoC.
 */
typedef enum _dma_request_source
{
    kDma0RequestDisabled            = 0U,          /**< Disabled */
    kDma0RequestWUU0                = 1U,          /**< WUU Wake up event */
    kDma0RequestMuxFlexCan0DmaRequest = 2U,        /**< CAN0 DMA request */
    kDma0RequestLPI2C2Rx            = 3U,          /**< LPI2C2 Receive request */
    kDma0RequestLPI2C2Tx            = 4U,          /**< LPI2C2 Transmit request */
    kDma0RequestLPI2C3Rx            = 5U,          /**< LPI2C3 Receive request */
    kDma0RequestLPI2C3Tx            = 6U,          /**< LPI2C3 Transmit request */
    kDma0RequestMuxI3c0Rx           = 7U,          /**< I3C0 Receive request */
    kDma0RequestMuxI3c0Tx           = 8U,          /**< I3C0 Transmit request */
    kDma0RequestLPI2C0Rx            = 11U,         /**< LPI2C0 Receive request */
    kDma0RequestLPI2C0Tx            = 12U,         /**< LPI2C0 Transmit request */
    kDma0RequestLPI2C1Rx            = 13U,         /**< LPI2C1 Receive request */
    kDma0RequestLPI2C1Tx            = 14U,         /**< LPI2C1 Transmit request */
    kDma0RequestLPSPI0Rx            = 15U,         /**< LPSPI0 Receive request */
    kDma0RequestLPSPI0Tx            = 16U,         /**< LPSPI0 Transmit request */
    kDma0RequestLPSPI1Rx            = 17U,         /**< LPSPI1 Receive request */
    kDma0RequestLPSPI1Tx            = 18U,         /**< LPSPI1 Transmit request */
    kDma0RequestLPUART0Rx           = 21U,         /**< LPUART0 Receive request */
    kDma0RequestLPUART0Tx           = 22U,         /**< LPUART0 Transmit request */
    kDma0RequestLPUART1Rx           = 23U,         /**< LPUART1 Receive request */
    kDma0RequestLPUART1Tx           = 24U,         /**< LPUART1 Transmit request */
    kDma0RequestLPUART2Rx           = 25U,         /**< LPUART2 Receive request */
    kDma0RequestLPUART2Tx           = 26U,         /**< LPUART2 Transmit request */
    kDma0RequestLPUART3Rx           = 27U,         /**< LPUART3 Receive request */
    kDma0RequestLPUART3Tx           = 28U,         /**< LPUART3 Transmit request */
    kDma0RequestLPUART4Rx           = 29U,         /**< LPUART4 Receive request */
    kDma0RequestLPUART4Tx           = 30U,         /**< LPUART4 Transmit request */
    kDma0RequestMuxCtimer0M0        = 31U,         /**< CTIMER0 Match channel 0 request */
    kDma0RequestMuxCtimer0M1        = 32U,         /**< CTIMER0 Match channel 1 request */
    kDma0RequestMuxCtimer1M0        = 33U,         /**< CTIMER1 Match channel 0 request */
    kDma0RequestMuxCtimer1M1        = 34U,         /**< CTIMER1 Match channel 1 request */
    kDma0RequestMuxCtimer2M0        = 35U,         /**< CTIMER2 Match channel 0 request */
    kDma0RequestMuxCtimer2M1        = 36U,         /**< CTIMER2 Match channel 1 request */
    kDma0RequestMuxCtimer3M0        = 37U,         /**< CTIMER3 Match channel 0 request */
    kDma0RequestMuxCtimer3M1        = 38U,         /**< CTIMER3 Match channel 1 request */
    kDma0RequestMuxCtimer4M0        = 39U,         /**< CTIMER4 Match channel 0 request */
    kDma0RequestMuxCtimer4M1        = 40U,         /**< CTIMER4 Match channel 1 request */
    kDma0RequestMuxFlexPWM0ReqCapt0 = 41U,         /**< FlexPWM0 capture0 request */
    kDma0RequestMuxFlexPWM0ReqCapt1 = 42U,         /**< FlexPWM0 capture1 request */
    kDma0RequestMuxFlexPWM0ReqCapt2 = 43U,         /**< FlexPWM0 capture2 request */
    kDma0RequestMuxFlexPWM0ReqVal0  = 45U,         /**< FlexPWM0 value0 request */
    kDma0RequestMuxFlexPWM0ReqVal1  = 46U,         /**< FlexPWM0 value1 request */
    kDma0RequestMuxFlexPWM0ReqVal2  = 47U,         /**< FlexPWM0 value2 request */
    kDma0RequestMuxLptmr0           = 49U,         /**< LPTMR0 Counter match event */
    kDma0RequestMuxAdc0FifoRequest  = 51U,         /**< ADC0 FIFO request */
    kDma0RequestMuxAdc1FifoRequest  = 52U,         /**< ADC1 FIFO request */
    kDma0RequestMuxHsCmp0DmaRequest = 53U,         /**< CMP0 DMA_request */
    kDma0RequestMuxHsCmp1DmaRequest = 54U,         /**< CMP1 DMA_request */
    kDma0RequestMuxDac0FifoRequest  = 56U,         /**< DAC0 FIFO request */
    kDma0RequestMuxGpio0PinEventRequest0 = 60U,    /**< GPIO0 Pin event request 0 */
    kDma0RequestMuxGpio1PinEventRequest0 = 61U,    /**< GPIO1 Pin event request 0 */
    kDma0RequestMuxGpio2PinEventRequest0 = 62U,    /**< GPIO2 Pin event request 0 */
    kDma0RequestMuxGpio3PinEventRequest0 = 63U,    /**< GPIO3 Pin event request 0 */
    kDma0RequestMuxGpio4PinEventRequest0 = 64U,    /**< GPIO4 Pin event request 0 */
    kDma0RequestMuxQdc0             = 65U,         /**< QDC0 DMA request for new buffered value  */
    kDma0RequestMuxQdc1             = 66U,         /**< QDC1 DMA request for new buffered value  */
    kDma0RequestMuxFlexIO0ShiftRegister0Request = 71U, /**< FlexIO0 Shifter0 Status DMA request OR Timer0 Status DMA request */
    kDma0RequestMuxFlexIO0ShiftRegister1Request = 72U, /**< FlexIO0 Shifter1 Status DMA request OR Timer1 Status DMA request */
    kDma0RequestMuxFlexIO0ShiftRegister2Request = 73U, /**< FlexIO0 Shifter2 Status DMA request OR Timer2 Status DMA request */
    kDma0RequestMuxFlexIO0ShiftRegister3Request = 74U, /**< FlexIO0 Shifter3 Status DMA request OR Timer3 Status DMA request */
    kDma0RequestMuxFlexPWM1ReqCapt0 = 79U,         /**< FlexPWM1 capture0 request */
    kDma0RequestMuxFlexPWM1ReqCapt1 = 80U,         /**< FlexPWM1 capture1 request */
    kDma0RequestMuxFlexPWM1ReqCapt2 = 81U,         /**< FlexPWM1 capture2 request */
    kDma0RequestMuxFlexPWM1ReqVal0  = 83U,         /**< FlexPWM1 value0 request */
    kDma0RequestMuxFlexPWM1ReqVal1  = 84U,         /**< FlexPWM1 value1 request */
    kDma0RequestMuxFlexPWM1ReqVal2  = 85U,         /**< FlexPWM1 value2 request */
} dma_request_source_t;

/* @} */
#endif /* DMA_REQUEST_SOURCE_T_ */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


